{
  "_comment": "Tier 2: Moderate-Impact Lifecycle Policies - Audit Mode (Months 4-5)",
  "_description": "25 policies for lifecycle management. Deploy after Tier 1 is stable. Requires rotation processes.",
  "_timeline": "Months 4-5: Audit mode (60 days) → Establish baseline",
  "_successCriteria": "<10% violation rate before proceeding to Deny mode",
  "_reference": "See ProductionRolloutPlan.md - Tier 2 section",
  
  "Keys should not be active for longer than the specified number of days": {
    "maximumValidityInDays": 365,
    "effect": "Audit"
  },
  "Keys should have more than the specified number of days before expiration": {
    "minimumDaysBeforeExpiration": 30,
    "effect": "Audit"
  },
  "Keys should have a rotation policy ensuring that their rotation is scheduled within the specified number of days after creation.": {
    "maximumDaysToRotate": 90,
    "effect": "Audit"
  },
  "Keys should have the specified maximum validity period": {
    "maximumValidityInDays": 730,
    "effect": "Audit"
  },
  "Keys should be the specified cryptographic type RSA or EC": {
    "allowedKeyTypes": ["RSA", "EC"],
    "effect": "Audit"
  },
  "Keys using elliptic curve cryptography should have the specified curve names": {
    "allowedECNames": ["P-256", "P-256K", "P-384", "P-521"],
    "effect": "Audit"
  },
  "Resource logs in Key Vault should be enabled": {
    "effect": "AuditIfNotExists",
    "requiredRetentionDays": "365"
  },
  "Secrets should not be active for longer than the specified number of days": {
    "maximumValidityInDays": 365,
    "effect": "Audit"
  },
  "Secrets should have more than the specified number of days before expiration": {
    "minimumDaysBeforeExpiration": 30,
    "effect": "Audit"
  },
  "Secrets should have content type set": {
    "effect": "Audit"
  },
  "Secrets should have the specified maximum validity period": {
    "maximumValidityInDays": 365,
    "effect": "Audit"
  },
  "Certificates using RSA cryptography should have the specified minimum key size": {
    "minimumRSAKeySize": 2048,
    "effect": "Audit"
  },
  "Certificates should use allowed key types": {
    "allowedKeyTypes": ["RSA", "EC"],
    "effect": "Audit"
  },
  "Certificates using elliptic curve cryptography should have allowed curve names": {
    "allowedECNames": ["P-256", "P-256K", "P-384", "P-521"],
    "effect": "Audit"
  },
  "Certificates should have the specified lifetime action triggers": {
    "maximumPercentageLife": 80,
    "minimumDaysBeforeExpiry": 30,
    "effect": "Audit"
  },
  "Certificates should be issued by the specified integrated certificate authority": {
    "allowedCAs": ["DigiCert", "GlobalSign"],
    "effect": "Audit"
  },
  "Certificates should be issued by the specified non-integrated certificate authority": {
    "caCommonName": "ContosoCA",
    "effect": "Audit"
  },
  "Certificates should be issued by one of the specified non-integrated certificate authorities": {
    "caCommonNames": ["ContosoCA", "FabrikamCA"],
    "effect": "Audit"
  },
  "Azure Key Vault Managed HSM should have purge protection enabled": {
    "effect": "Audit"
  },
  "Azure Key Vault should disable public network access": {
    "effect": "Audit"
  },
  "[Preview]: Azure Key Vault Managed HSM keys should have an expiration date": {
    "effect": "Audit"
  },
  "[Preview]: Azure Key Vault Managed HSM Keys should have more than the specified number of days before expiration": {
    "minimumDaysBeforeExpiration": 30,
    "effect": "Audit"
  },
  "[Preview]: Azure Key Vault Managed HSM keys using RSA cryptography should have a specified minimum key size": {
    "minimumRSAKeySize": 2048,
    "effect": "Audit"
  },
  "[Preview]: Azure Key Vault Managed HSM keys using elliptic curve cryptography should have the specified curve names": {
    "allowedECNames": ["P-256", "P-256K", "P-384", "P-521"],
    "effect": "Audit"
  },
  "Resource logs in Azure Key Vault Managed HSM should be enabled": {
    "effect": "AuditIfNotExists"
  }
}
